{
  "id": "1kpts0c",
  "subreddit": "Music",
  "title": "Katy Perry not welcome in Vegas after ‘complete failure’ residency lost luxury hotel money: report",
  "author": "Top_Report_4895",
  "selftext": "",
  "imageUrl": null,
  "postType": "thread",
  "comments": [
    {
      "id": "mt0jxy8",
      "author": "fabreazebrother_1",
      "body": "The casino lost a bet and now they're upset about it?",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0y715",
          "author": "Mammoth_Hair1134",
          "body": "Casinos love using shady practices to lure and trap addicts. But they make a bad business decision, and they run crying, screaming, and shaking their fists to the media how unfair life is. Won't anyone think of the poor casino owners?! So pathetic.",
          "hasSnippet": false
        },
        {
          "id": "mt19y47",
          "author": "ominousgraycat",
          "body": "Casinos don't gamble. At least not very often. Any games on the casino floors very rarely lose more money than they take, and in sports gambling, they try to set it up so they make a profit regardless of the results. And even on the rare occasion they lose money on a certain type of bet on a big event, they loudly announce it to the media which they use as free advertising so a bunch of other people come and gamble, but it usually doesn't happen twice in a row so all the others lose money to the casino.",
          "hasSnippet": false
        },
        {
          "id": "mt0wqax",
          "author": "Lightzephyrx",
          "body": "Typical Vegas",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0igcy",
      "author": "Aliensinmypants",
      "body": "Making up to $900k a show for the span of her residency is fucking lunacy. I ain't even mad at Perry, that's on the hotel for signing that.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0j3rs",
          "author": "JEMS93",
          "body": "Agreed, when the hotel decided to pay it thats on them",
          "hasSnippet": false
        },
        {
          "id": "mt0mxs7",
          "author": "CaptainPigtails",
          "body": "How would that even make any financial sense? The average ticket cost would be like $200 with a fully packed show just to break even on her pay.",
          "hasSnippet": false
        },
        {
          "id": "mt0tggy",
          "author": "Czarchitect",
          "body": "Honestly respect to her for getting that kind of deal. I'll shed zero tears for some billion dollar luxury brand hotel casino losing money hitching themselves to a has been pop star.",
          "hasSnippet": false
        },
        {
          "id": "mt0pkdm",
          "author": "chinoswirls",
          "body": "&gt;\"Katy was getting paid between $750,000 and $900,000 a show because of the bidding war, and the entire run she underperformed and Resorts World lost money,\"\n\nResorts World Theatre › Capacity 5,000\n\n750,000 / 5000 = 150 per ticket for her\n\nThat is assuming she was paid the lowest amount and the venue sold out (which it didn't).\n\nThe ticket prices were not what i expected after doing the math. I guess she got paid with or without ticket sales?\n\n&gt;Katy Perry's Las Vegas residency, called \"Play,\" which ran from December 29, 2021, to November 4, 2023, had ticket prices that varied. OregonLive.com reported that tickets could be found for as low as $75, while VIP options started around $350. Business Insider noted that resale tickets on StubHub ranged from $70 to $400, and Vivid Seats offered similar pricing, with the most affordable options ranging from $55 to $396. Vivid Seats also mentioned VIP packages averaging $500 to $1000",
          "hasSnippet": false
        },
        {
          "id": "mt178h4",
          "author": "Sir0inks-A-Lot",
          "body": "Resorts World is a complete disaster so this is 100% on brand for them",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0lod9",
      "author": "getwhirleddotcom",
      "body": "For reference, Resorts World has been one of the biggest blunders in modern Vegas history.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt1l94n",
          "author": "itissmall",
          "body": "I've been a few times and it's an awesome space. It just has a few problems that bury it:\n\n\n-on the strip but not walkable to anything. So you're paying huge prices for the land, but everyone wants a walkable hotel, so no one wants to stay there. The entrance is built strangely far from Las vegas Blvd\n\n\n-no main draw. If you're gonna be even slightly off the strip, no foot traffic means you gotta get people psyched. Everything about the hotel is like, 7.5/10 cool. Not worth the inconvenience. No \"fun thing to see\" like the bellagio garden/fountain, canal in the venetian, excalibur castle, etc. ",
          "hasSnippet": false
        },
        {
          "id": "mt196a3",
          "author": "ult_frisbee_chad",
          "body": "It feels so bright and sterile in there. Wynn is similar, but somehow feels so much more inviting.",
          "hasSnippet": false
        },
        {
          "id": "mt1od71",
          "author": "CrashTestOrphan",
          "body": "Didn't they just have that Mr Beast Experience debacle too?",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0k94i",
      "author": "0btuse_0val",
      "body": "&gt;not welcome in Vegas\n\nBit of an exaggeration I imagine",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0qa64",
          "author": "Ghoulius-Caesar",
          "body": "Trust me, I just came back from Vegas, there’s an officer at every entrance making sure nobody is trying to smuggle in a Katy Perry. Every highway, airport, river port and oceanic port in Las Vegas is being blockaded!",
          "hasSnippet": false
        },
        {
          "id": "mt0lnr1",
          "author": "IamAWorldChampionAMA",
          "body": "Casino exec here. We had our annual blood drinking meeting and voted 63% to 47% that she's not welcomed in Vegas.",
          "hasSnippet": false
        },
        {
          "id": "mt0tv3a",
          "author": "GreatWhiteNorthExtra",
          "body": "By reading the article, it's not that she is banned but no hotel is going to take a chance on paying her for a residency.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0imjn",
      "author": "thenseruame",
      "body": "Jesus, $750,000 a show, no wonder they lost money.  It looks like the theatre has a 4,700 seat capacity so that means tickets would have to be a couple hundred dollars just to pay her salary.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0lurt",
          "author": "AdamOnFirst",
          "body": "Yeah, wow, over $150 in revenue needed per seat for her alone. Then you have all the other costs and any unsold tickets. You’re a casino hotel, so you don’t need to actually be traditionally profitable for it to still make money - Vegas obviously classically has used entertainers to draw crowds to pay to stay, eat, and gamble, but you better have a BIG fucking crowd at every show, all dumping money into the slots, to pay that cost  ",
          "hasSnippet": false
        },
        {
          "id": "mt0m0bd",
          "author": "Shafter111",
          "body": "Dont know the timings but Taylor Swifts tour success and prices really gave the industry too much optimism in their abilities to draw a crowd.",
          "hasSnippet": false
        },
        {
          "id": "mt0mjg8",
          "author": "spookynutz",
          "body": "The casino doesn’t assume ticket prices are the only path to profitability for these shows. It’s a strategic decision, hoping that the draw of the performer will attract high rollers to the casino. If ticket sales result in the recoupment of production costs, that’s great, but it’s not the sole revenue source. A lot of residencies function as a loss leader.\n\nIn some way, it’s a real world version of the free-to-play or DLC-driven gaming model. It’s a mass-market shotgun approach that casts a wide net, but the primary targets are the whales.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0iqpz",
      "author": "biglyorbigleague",
      "body": "New York Post-ass title",
      "hasSnippet": true,
      "replies": [
        {
          "id": "mt14vwo",
          "author": "hat_trix66",
          "body": "Missing a “Hotel says ‘Beat it, Bozo!’”",
          "hasSnippet": false
        },
        {
          "id": "mt19ngd",
          "author": "catclockticking",
          "body": "You clocked it — Yahoo’s syndicating this article directly from the Post",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0knkm",
      "author": "AdamOnFirst",
      "body": "lol, massive and sophisticated hospitality corporation gets into pissing contest with another massive corporation, signs shitty deal that includes travel lull (first part of the residency was before Vegas was like 100% packed again, I believe) tries to spin it not going well as if it’s because the contracted performer somehow did something wrong and it’s not their fault.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0m6n7",
          "author": "platinumarks",
          "body": "The only reason they got into a bidding match was because the resort was new and they were hoping the buzz would get people to come. The problem is, Vegas isn't the hot spot any more that it used to be, especially in the face of rising inflation. Sure, it's still making money, but a lot of tourist destinations got convinced that the post-COVID travel boom would keep rolling and that was a risky bet for them.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0hqon",
      "author": "Fly_Pelican",
      "body": "With $400 million, why not just retire?",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0kwo1",
          "author": "SuspectMore4271",
          "body": "I used to just street perform for free. It’s fun to entertain an audience. I’d imagine a stadium full of fans would be straight up addictive.",
          "hasSnippet": false
        },
        {
          "id": "mt0ip3m",
          "author": "Lollipopsaurus",
          "body": "There’s nothing to back this up, but if you overspend at that level of wealth, you can lose it quickly. Then you have to replace it somehow. Doing 5 shows a week and earning half a million per show could keep a spending habit going for a long time.",
          "hasSnippet": false
        },
        {
          "id": "mt0jjt6",
          "author": "MaceTheMindSculptor",
          "body": "Because she likes to perform",
          "hasSnippet": false
        },
        {
          "id": "mt0ib2z",
          "author": "Electricengineer",
          "body": "People around you don't say no",
          "hasSnippet": false
        },
        {
          "id": "mt0is2k",
          "author": "a_talking_face",
          "body": "Believe it or not, some people actually enjoy what they do.",
          "hasSnippet": false
        },
        {
          "id": "mt0j4gw",
          "author": "DeezNeezuts",
          "body": "She enjoys what she does.",
          "hasSnippet": false
        },
        {
          "id": "mt0r5zz",
          "author": "baccus83",
          "body": "Maybe she just really enjoys her job?\n\nMaybe she has extremely poor spending habits?",
          "hasSnippet": false
        },
        {
          "id": "mt0l9ku",
          "author": "AdamOnFirst",
          "body": "She’s a musician, not an accountant, she probably loves it. She can dictate terms she wants to perform under, like more or fewer performance dates, fitting the travel around a personel schedule, residencies somewhere she enjoys being, etc. She has a huge group of people around her who are all part of her enterprise, to say nothing of the hundreds of stage crew, traveling people, backup performers, etc who make a living as part of her shows.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0it8s",
      "author": "ballysham",
      "body": "I'm starting to wonder who Katy Perry pissed off. The media recently has been crazy",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt0kmx6",
          "author": "GregorSamsaa",
          "body": "This may be a situation of the media giving the people what they want. Katy hate started on social media and now the media knows that piling on is guaranteed engagement on their articles and posts and thus ad revenue",
          "hasSnippet": false
        },
        {
          "id": "mt0pb4w",
          "author": "ehxy",
          "body": "I think that her break from her career has harmed her career more than anything.\n\nNow..she's like a friend's newly divorced mom trying to relive her 20's and it's....well.  We all feel for our friend who has to put up with it.",
          "hasSnippet": false
        },
        {
          "id": "mt0kd4i",
          "author": "CookieKid247",
          "body": "She pissed off a lot of people by being a rape apologist",
          "hasSnippet": false
        },
        {
          "id": "mt1nr6p",
          "author": "angelamar",
          "body": "Yeah, I’m confused. The hate started after the Blue Orgin ride, but why only her? She has a terrible choreographer too. That person should be fired. I’m not a fan of her music, but I feel a little bad for her.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0q57o",
      "author": "pimpfmode",
      "body": "Reading about the residency on Wikipedia it seems that it was successful and the show made money.. It just seems like the casino overpaid to get her residency. That's on them.  \n\nThis article seems to be out there to just pile on.",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mt0zdew",
      "author": "SavageCucmber",
      "body": "Why is that Katy Perry's fault? The hotel signed the contract and knew the terms. Losers.",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mt0izwq",
      "author": "rhunter99",
      "body": "I saw her last date for PLAY and had a great time. The place was sold out (from what I could tell), everyone was singing with the classics, and the sets were super fun.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mt1oipr",
          "author": "Digitalion_",
          "body": "I went to the 3rd to last show and had the same experience. It was a pretty good show. Yeah she was a little cringe at times but she was self-aware and charismatic enough to pull it off. She was fully aware that she sold out to the music industry and sexualized herself to make the big bucks.\n\nBut she does have plenty of bangers in her catalog that made it a fun show. I'm also very glad she mostly stuck to her older songs because her newer music kinda sucks.",
          "hasSnippet": false
        },
        {
          "id": "mt0jof2",
          "author": "Wyxter",
          "body": "Glad someone else had this experience! I’m a young guy who grew up with those songs and went with some friends and had a great time!",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mt0kgs5",
      "author": "dreburden89",
      "body": "That's what you get for waking up in Vegas",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mt0kal8",
      "author": "SarahCannah",
      "body": "Good grief. I am not a fan, but what did she do to create this shitstorm of hate? It’s multiple posts every day.",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mt0hg5d",
      "author": "kombatunit",
      "body": "Surprising, after seeing her latest dance routines..... Also, that beer can dress is hella cringe.",
      "hasSnippet": false,
      "replies": []
    }
  ],
  "snippets": [
    {
      "commentId": "mt0iqpz",
      "query": "New York Post-ass title",
      "songName": "That's Facts",
      "artistName": "Lil Baby & Lil Durk",
      "artworkUrl": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/9a/51/3f/9a513f0d-452a-a4de-aa54-3d629a94d2c3/21UMGIM47174.rgb.jpg/300x300bb.jpg",
      "previewUrl": "https://audio-ssl.itunes.apple.com/itunes-assets/AudioPreview112/v4/f5/7a/0e/f57a0e24-769b-6d3b-b162-a83e80a82e0d/mzaf_10284531914136825001.plus.aac.p.m4a"
    }
  ]
}