{
  "id": "1irua39",
  "subreddit": "musicsuggestions",
  "title": "Stevie Wonder",
  "author": "Amber_Flowers_133",
  "selftext": "👨🏽‍🎤",
  "imageUrl": "https://i.redd.it/o3otujnygrje1.jpeg",
  "postType": "thread",
  "comments": [
    {
      "id": "mdbi2p3",
      "author": "ImSmarterThanU_duh",
      "body": "Louis Armstrong, there's no one who sounds even remotely similar",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mdc7pv4",
          "author": "jpkdc",
          "body": "I was watching Ken Burn's Jazz documentary today, and in talking about Armstrong, they said he invented modern singing and everyone else after copied him. The people saying this seemed very expert, but this was def news to me as he seemed like a total outlier in singing style.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mdbepm9",
      "author": "Add_8_Years",
      "body": "Ozzy Osbourne",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbeq4c",
      "author": "Joejoe988",
      "body": "Tom Waits",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mdck93c",
          "author": "UnderpootedTampion",
          "body": "For no one",
          "hasSnippet": false
        },
        {
          "id": "mddxv4w",
          "author": "Lamlot",
          "body": "My favorite artist, I have almost all of his albums on vinyl.",
          "hasSnippet": false
        },
        {
          "id": "mdbzaju",
          "author": "BenGrimmspaperweight",
          "body": "Genuinely can't think of a better example, even in his early years he was really distinctive.",
          "hasSnippet": false
        },
        {
          "id": "mdhxhhm",
          "author": "felixgifford",
          "body": "Tommy the cat is my name! And I say on to thee.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mdbeosu",
      "author": "mountednoble99",
      "body": "Joe Cocker",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbcgiu",
      "author": "NavyDad0536",
      "body": "Tiny Tim, no way can he ever be mistaken for someone else.",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdba6vr",
      "author": "Past-Isopod-138",
      "body": "Geddy Lee",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mdd5gqp",
          "author": "KTPChannel",
          "body": "Funny story. \n\n20 years ago I had a friend who fought lightweight MMA in Canada. Hated Geddy Lee’s voice. Drove him nuts. \n\nNow, the worst part of being a MMA fighter is cutting weight the day before. Just drains the moral of the fighter. You’re sitting in a sauna in a track suit dehydrating yourself 24 hours before getting punched in the face for a couple hundred bucks. Stupid life choices, but hey, to each their own. \n\nNobody wants to help a guy cut weight. It’s just a miserable experience. You’re hanging out, keeping the guy company, sneaking off to drink water and making sure the guy doesn’t accidentally mess himself up. Meanwhile, a professional fighter is getting quite irritable, and you’re the focus of his frustration. \n\nNow, this particular weight cut, my friend is getting on my last nerve. I know he’s dehydrated and angry, but the idle threats on my life are getting a little too detailed. I got to take it, because this isn’t about me, it’s about him, but all his rhetoric is getting filed in the old mental Rolodex. \n\nWe get to weigh ins and he makes weight. Promoter takes me aside (I’m his second in the corner, promoter is smart enough not to start a conversation with a dehydrated fighter), and asks about walk out music so he can get licensing. \n\nWe agreed it would be Hatebreed, his favourite band at the time. \n\nWell, guess what? Fuck him. \n\n“Tom Sawyer by Rush”. I say. \n\nFight night comes, we’re at the entrance, opponent is in ring. He gets to the gorilla spot and the music hits. \n\nHe turns and looks right through me. Like a hundred yard stare into my soul. \nI’m still choked at him, so I’m beaming from ear to ear, like the asshole I am. He knows. I know he knows. He knows I did it on purpose, no fucks given. The lead corner can feel the heat; you could fry an egg on my fat bald head. \n\nWe get walking and he’s stiff. Madder than shit. I’m loving this moment. \n\nFight starts, they dance for a minute, no take downs, get into a clinch, go for a break, and my guy throws an elbow, catches his opponent on the button. \n\nFirst round knock out, from an elbow. \n\nNobody gets knocked out by an elbow. It’s one of those “stars aligned”, buy a lottery ticket, struck by lightning moments. \n\nCrowd goes nuts, interview goes great, promoters gushing over him, opponents corner (great guys, great gym) can’t believe what happened. \n\nWe get to the back, his gloves get cut and bagged, hit the showers, and he turns to me;\n\n“Why would you do that?” \n\nI look him dead in the eye, and tell him the truth;\n\n“Today’s Tom Sawyer he gets high on you, and the space he invades, he gets by on you!”\n\nWhen I came to, the promoter and rep from the commission are standing over me. My guys in the shower with his lead corner, cooling off. Commish rep asks if he should write a report, I told him I had it coming and it’s best if we keep it dark. They agree; nobody wants the bad press. \n\nFor years after, every time Tom Sawyer came on the radio, I’d crank it up and call him to make sure he’d hear it. Even played it for him at my wedding (he was a groomsman). \n\nThe gym took me off weight cut duty the next week. \n\nGood times. I wish I could live that moment again. \n\nI hope Geddy Lee lives forever.",
          "hasSnippet": false
        },
        {
          "id": "mdd234x",
          "author": "Johnny_Radar",
          "body": "Came here to say “Geddy Lee”, see it was already taken care of. 👍👍",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mdccdh4",
      "author": "DominantDave",
      "body": "Dolores O’Riodan of The Cranberries.  Nobody sings like her",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbshmi",
      "author": "unclesamtattoo",
      "body": "Willie Nelson",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mdc2xvr",
          "author": "zaxxon4ever",
          "body": "Wow...I had to scroll wayyyy down for Willie.  He was the first one to come to my mind.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mdbq014",
      "author": "No-Series7667",
      "body": "Billy Corgan &amp; Gerard Way",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbuawk",
      "author": "stormtrooperjgd1",
      "body": "Freddie Mercury ",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbj008",
      "author": "M41arky",
      "body": "Surprised nobody has mentioned Freddie Mercury",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mdc7w6c",
          "author": "jpkdc",
          "body": "I think Freddie has a perfect voice, but not sure it is so distinctive.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mdbqi9u",
      "author": "jensens22",
      "body": "Kurt Cobain",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbr9y7",
      "author": "Rhyno429",
      "body": "Macey Gray",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mdbzo59",
      "author": "Emotional_Wallaby_98",
      "body": "David bowie",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mdcfker",
          "author": "nint3njoe_2003",
          "body": "Should be higher, his voice is iconic",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mdbfgd8",
      "author": "MasterLowpiece",
      "body": "Rod Stewart",
      "hasSnippet": false,
      "replies": []
    }
  ],
  "snippets": []
}