{
  "id": "1kng27e",
  "subreddit": "Music",
  "title": "Justin Bieber Sold Music Catalog For $200 Million Because He Was Broke",
  "author": "AdSpecialist6598",
  "selftext": "",
  "imageUrl": null,
  "postType": "news",
  "comments": [
    {
      "id": "msin8r1",
      "author": "rmusicmods",
      "body": "**While Bieber did sell his catalog for \\~$200 million in 2023, the claims about him being \"broke\" or in \"financial collapse\" are strongly disputed by his representatives.** A TMZ documentary presents these financial distress allegations as established facts without providing substantial independent verification.\n\nSome relevant points:\n\n* Yes, the catalog sale to Hipgnosis Songs Capital definitely happened\n* Yes, Bieber reportedly had some financial obligations (including \\~$20M to AEG for the canceled tour)\n* However, most media reports citing \"financial distress\" seem to be referencing TMZ's documentary rather than providing independent confirmation\n\n*Please keep discussions civil and remember that the financial collapse narrative remains a disputed claim, not a confirmed fact.*",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mshxr24",
      "author": "SnooDonuts6980",
      "body": "If he blew through $500m-$1bn it seems unlikely $200m will last him. \n\nMany celebrities don’t account for the lifestyle creep, especially when you are paying multiple staff + utilities and taxes on multiple vehicles, houses, etc",
      "hasSnippet": false,
      "replies": [
        {
          "id": "msl8l7z",
          "author": "Belgand",
          "body": "I remember in *The Dirt* how Nikki Sixx was talking about how he found out it was costing him something insane like $10,000 a month just to air condition his mansion that he wasn't spending that much time in. Most people don't think about the massive amount of money spent simply on things like upkeep.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "msi16gk",
      "author": "Chrisboy265",
      "body": "Unless he has a TON of debt, he’ll never actually be broke due to music royalties. Now that he sold the rights to his music, actually becoming broke is a realistic possibility.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "msi9iwg",
          "author": "Basic_Chemistry_900",
          "body": "And usually broke here means They can't continue to fund their extravagant lifestyle and maintain all the expensive things that they have like properties and cars.",
          "hasSnippet": false
        },
        {
          "id": "msi79iu",
          "author": "PotOfGreed099",
          "body": "Yup. Now he has no way of making money from his catalog… that was the first rule in a music publishing book I read; NEVER sell the rights to your music, because then you can’t make any more money from it. Big mistake.",
          "hasSnippet": false
        },
        {
          "id": "msicqio",
          "author": "az943",
          "body": "But wasn’t this only selling the existing music at the time? this doesn’t include any music he has made since then and doesn’t include all the shows he could or is potentially doing also? I feel like at his age it’s actually not terrible because he still stands to make a ton of money",
          "hasSnippet": false
        },
        {
          "id": "msijsxl",
          "author": "SKRRTCOBAIN222",
          "body": "Justin Bieber is fucking gigantic. He could find work anywhere in a heartbeat. Modeling. Features. He could make a completely trash album and have enough to live comfortably. Mf will not go broke ever in his lifetime. Even Kanye who has absolutely murdered his reputation could find work anywhere. When ur big enough you can fuckin do whatever you want. Ur name is money $$$ all they care about.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshwr3o",
      "author": "PoPo573",
      "body": "I feel like \"celebrity\" broke isn't actually broke. They're so far removed from reality they can't even imagine what having no money really means.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mshyhnq",
          "author": "Mrchristopherrr",
          "body": "I don’t remember who said it (it could have even been himself) but someone said in regards to Kanye that after you hit a certain point your absolute rock bottom is still a massive house in a gated community living a life better than 99.9% of other people.",
          "hasSnippet": false
        },
        {
          "id": "msi0sb1",
          "author": "Maccai3",
          "body": "He owns at least 4 mansions, he's doing better than any of us ever will be and this is him \"broke\"",
          "hasSnippet": false
        },
        {
          "id": "mshz1dg",
          "author": "southsiderick",
          "body": "There will always be a decent-paying gig out there for this guy. He'll never be broke like I was at his age.",
          "hasSnippet": false
        },
        {
          "id": "msi51ee",
          "author": "zeolus123",
          "body": "Well celebrity broke usually is poor financial literacy.\nNot sure why anyone would feel bad for these people.\nDamn near all the money in the world for their $500million palatial  estates and luxury cars. But not enough sense to hire a Financial Planner.",
          "hasSnippet": false
        },
        {
          "id": "mshz1ld",
          "author": "sightlab",
          "body": "Yes and no - on the one hand, total disconnect with what \"broke\" means. On the other - and you see this a lot with young college athletes getting BIG contracts for the majors - they have a lot of money, but they end up spending it in breathtakingly unwise ways that end up costing more over time (multi million dollar houses with massive maintenance and tax costs) and go legitimately broke when $10 dollars turns into $2mil/year in expenses. Or get bad advice and may still HAVE $10million, but are behind $20mil in taxes.",
          "hasSnippet": false
        },
        {
          "id": "mshzgg3",
          "author": "whiskeyinmyglass",
          "body": "Maybe not “eating rice and beans” broke, but you can definitely leverage yourself so thin that when the pendulum swings to the side where money isn’t coming in like it was when you bought all that fancy shit, you can definitely feel the pinch. If you own $500 million in houses/cars/luxury goods and your income drops 50% from when you signed those contracts, you better believe you’re selling your music catalog to the highest bidder. Athletes are famous for doing this because they forget they’ll stop making income the day their body breaks down enough to be replaced by the newest, fittest athlete out of college. It’s the reason you see Super Bowl rings up for sale all the time. They keep them if they didn’t actually need the $10k they’re worth and weren’t up to their eyeballs in debt.",
          "hasSnippet": false
        },
        {
          "id": "mshzku5",
          "author": "Borgalicious",
          "body": "I was about to say, being on the verge of financial collapse when you have multiple million dollar homes and dozens of vehicles and god knows what else is very different from someone who is one missed payment away from homelessness",
          "hasSnippet": false
        },
        {
          "id": "msi19gv",
          "author": "AdSpecialist6598",
          "body": "Depends on what level you are because in showbiz 10-15 percent of people make 90 percent of the money, everyone else it trying to make a living and live a comfortable life the LA fires showed us that much.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshy7kh",
      "author": "james-HIMself",
      "body": "His music catalog is worth way more than 200 million btw. Selling for that low is doing so under duress. If juice wrld, a dead musician, music sold for 150 million for his catalog then Justin’s is worth somewhere around 500mil",
      "hasSnippet": false,
      "replies": [
        {
          "id": "msi8b6c",
          "author": "ohyoumad721",
          "body": "How in the fuck is juice wrld's catalog worth anywhere near that?",
          "hasSnippet": false
        },
        {
          "id": "msidi84",
          "author": "cabbeer",
          "body": "then he got a great price because he only owned 20% of it",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshvc1w",
      "author": "truedef",
      "body": "![gif](giphy|WRRIEjIXvWFUlOIFi0)",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mshw6wj",
          "author": "moonduder",
          "body": "![gif](giphy|3IHB6cLRnEzsxFEL6r)",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshy0k1",
      "author": "Pillens_burknerkorv",
      "body": "If he was broke and got 200 mill. He’s gonna be broke again soon…",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mshz4du",
          "author": "Rodgers4",
          "body": "He 100% will be and without any reciprocal income like he previously had.\n\nHe won the lottery, blew it, then won the lottery *again* and made sure that he took the lump sum rather than the annual disbursement, to show he learned nothing.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshvmjy",
      "author": "MomusSinclair",
      "body": "If Bieber had an asset worth $200m, then he wasn’t broke.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mshxdz3",
          "author": "PutsPlease",
          "body": "I’m broke too if you don’t take anything I own into account",
          "hasSnippet": false
        },
        {
          "id": "mshx6p5",
          "author": "pattyG80",
          "body": "Well, it depends, maybe he owed 200 million...then...",
          "hasSnippet": false
        },
        {
          "id": "msi08jf",
          "author": "Unique-Plum",
          "body": "Broke is about liquidity. If you have a stuff you can pawn for $5000 but $10 in the bank and owe $2000 in rent you are still broke even though the math says you have $3010 net worth. \n\nSame with celebs, if your short term liabilities cannot be covered by your liquid assets, you are broke. But it might still mean you have millions or even billions in assets.",
          "hasSnippet": false
        },
        {
          "id": "mshwq2g",
          "author": "SuperHeroPlumberDude",
          "body": "I wonder what his liabilities are?",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "msi0a68",
      "author": "Tsobaphomet",
      "body": "$200 Million is enough for an average person's entire bloodline to live off of until the end of the world.\n\nFor a \"celebrity\" it's enough for a down payment on a mansion.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "msidkwv",
          "author": "sweetplantveal",
          "body": "You'd be surprised how quickly it goes. People aren't living within their means when they inherit generational wealth.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshva3j",
      "author": "piscian19",
      "body": "I hate TMZ.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mshx1o9",
          "author": "mrscrewup",
          "body": "His life sucks ass if you think about it. Achieved everything in life and lost all privacy before turning 20. What else to look forward to in life?",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "msi7242",
      "author": "MusicCuratorOBML",
      "body": "I've always wondered, when musicians sell their catalog like that, do they have to pay to perform their own songs?",
      "hasSnippet": false,
      "replies": [
        {
          "id": "msjkb79",
          "author": "dapala1",
          "body": "No. They would be stupid to not have a live performance clause. That's why artists go on tour all the time. They don't make money on they're catalogue so they make money by touring.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "mshwjbh",
      "author": "Emotional-Cash2417",
      "body": "This whole report is cancerous",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "mshvpll",
      "author": "Vaestmannaeyjar",
      "body": "How in the nine effing hells do you go broke with 1 billion ? There aren't enough Rolls Royce and Ferraris in the world to spend that amount on, and you body has a maximum number of hookers you can hire (efficiently) in a day.",
      "hasSnippet": false,
      "replies": [
        {
          "id": "mshwj0f",
          "author": "Idlers_Dream",
          "body": "Living a lifestyle that costs 200 million a month without ever bothering to think about if that is sustainable.",
          "hasSnippet": false
        },
        {
          "id": "mshy8l8",
          "author": "AdSpecialist6598",
          "body": "Here's the thing, a fairly wealthy friend once told me that 1 people love spending other people's money, 2 the more money there is the dumber people get and 3 nobody is ready for a large sudden influx of money especially if it as massive amount and your young.",
          "hasSnippet": false
        }
      ]
    },
    {
      "id": "msidvtl",
      "author": "GoldenGod48",
      "body": "Now he can afford to buy a home in Ontario.",
      "hasSnippet": false,
      "replies": []
    },
    {
      "id": "msi10o2",
      "author": "ElGuano",
      "body": "What a shame. How much did he lose?\n\nWhatever that amount, I bet if I had 10% of it, nobody would ever hear from me again.",
      "hasSnippet": false,
      "replies": []
    }
  ],
  "snippets": []
}